spec: use a single node type for all value representations
